# Домашнее задание №5
# Разработать 3 отдельных функции, каждая решает свою задачу.
# Все функции должны вызываться из меню в главной функции main(),
# реализованного по аналогии с файлом tasks_1-3.py

# Задача №1
# Разработать программу, которая объединяет два списка, но добавлять элементы из второго списка 
# только если они не встречаются в первом. 
# Вход: два списка
# Выход: один список

# Задача №2
# Разработать программу, которая создает новый список, где каждый элемент - это сумма 
# соответствующих элементов из двух списков. Если списки разной длины, дополнять меньший список нулями.
# Вход: два списка
# Выход: один список

# Задача №3
# Разработать программу, которая обрабатывает список данных по следующим правилам:
#    1. Добавить в конец сумму всех чисел (append)
#    2. Добавить первые 3 элемента в начало (extend + срез)
#    3. Удалить каждый второй элемент (del + срезы)
#    4. Удалить все отрицательные числа (remove в цикле)