# Задача №1
# Создать класс Math, имеющий два целочисленных атрибута a и b. Внутри класса 
# реализовать методы сложения, вычитания, умножения и деления. Результат выполнения 
# операций выводить в консоль

# Задача №2
# Создать файл words.txt, содержащий 100 любых русских или английских слов,
# получить в коде информацию из этого файла и найти только те слова, которые начинаются 
# с согласной буквы и записать их в новый файл new_words.txt. 
# Информацию из нового файла вывести в консоль

# Задача №3
# Реализовать класс "Книга" с атрибутами "Название", "Автор", "Количество страниц", "Дата публикации" 
# Добавить методы для получения и для изменения всех атрибутов 
# + два метода для записи информации о книге в файл и для чтения этой информации из файла