# Задача №1
# Взять любую линейную функцию и построить график её изменения с помощью 
# matplotlib и PyQT5 по аналогии с кодом урока №11

# Задача №2 
# Создать окно в PyQt5, которое выводит информацию об одном экземпляре(объекте)
# класса из ДЗ№6(класс "Книга"), для этого подключить файл с классом "Книга" к файлу 
# с текущим ДЗ

# Задача №3
# Распределить все файлы в текущем проекте по папкам и подпапкам 
# и скопировать все полученные папки и файлы в новую рабочую папку
# Эту задачу сделать обязательно, т.к. на следующем занятии нам пригодится 
# этот новый каталог проекта